#ifndef _DATA_DEFINES_H_
#define _DATA_DEFINES_H_

//加工区放置时，物料放置点 相对于 靶纸圆心 的偏移
#define STEP1_X 133
#define STEP1_Y -10
//成品区放置时，物料放置点 相对于 靶纸圆心 的偏移
#define STEP2_X 0
#define STEP2_Y 131


/*-----------------------------------
|              成品区(744)          |
|                                   |
|                                   |
|                | \                |
|                 \ DIR:2           |
| 加              \               物|
| 工              \               料|
| 区      <-------*------->       区|
|(1050)    DIR:1  \    DIR:3   (426)|
|                 \                 |
|                 \                 |
|           DIR:0 \                 |
|                \ /         ////////
|                            /  发  |
|                            /  车  |
|                            /  区  |
-----------------------------------*/

//一个格子间距300，按照绝对坐标初始化

#define Color_err 230           //颜色识别区坐标 与 物料区中间物料坐标 的间距

#define Material_err 145        //物料的间距
#define Material_Dir 3          //物料区方向
#define Material_Pos_X 3600     //（！！！此处为颜色识别区坐标！！！）
#define Material_Pos_Y 1200

#define Process_err 300         //加工区的间距
#define Process_Dir 1           //加工区方向
#define Process_Pos_X 4200      //物料区中间物料坐标
#define Process_Pos_Y 1200

#define Final_err 300           //成品区的间距
#define Final_Dir 2             //成品区方向
#define Final_Pos_X 1200        //成品区中间物料坐标
#define Final_Pos_Y 1800
////////////////////////////////////////////////////////////////////////////////////
//（！！！以下舵机值在更换舵机或拆卸后应重新标定！！！）
////////////////////////////////////////////////////////////////////////////////////
//底盘舵机根据方向有四种情况
#define Start_Dir 508//744//底盘初始姿态（1号舵机）

#define Material_Dir0 1168//426//底盘面朝物料区（1号舵机）
#define Material_Dir1 862//426//底盘面朝物料区（1号舵机）
#define Material_Dir2 508//426//底盘面朝物料区（1号舵机）
#define Material_Dir3 250//426//底盘面朝物料区（1号舵机）

#define Process_Dir0 1168//1070//底盘面朝加工区（1号舵机）
#define Process_Dir1 862//1070//底盘面朝加工区（1号舵机）
#define Process_Dir2 508//1070//底盘面朝加工区（1号舵机）
#define Process_Dir3 250//1070//底盘面朝加工区（1号舵机）

#define Final_Dir0 1168//744//底盘面朝成品区（1号舵机）
#define Final_Dir1 862//744//底盘面朝成品区（1号舵机）
#define Final_Dir2 508//744//底盘面朝成品区（1号舵机）
#define Final_Dir3 250//744//底盘面朝成品区（1号舵机）
////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////

#define Servo2_PosA 348//1104//2号舵机姿态A(初始姿态)
#define Servo2_PosB 800//816//2号舵机姿态B(物料区颜色识别)
#define Servo2_PosC 810//900//575//2号舵机姿态C(抓取放下)
#define Servo2_PosD 348//1050//2号舵机姿态D(抬起，多组共用)
#define Servo2_PosE 750//828//625//2号舵机姿态E(色环颜色识别)
#define Servo2_PosF 966//475//2号舵机姿态F(加工放置1)
#define Servo2_PosG 966//475//2号舵机姿态G(加工放置2)
#define Servo2_PosH 750//475//2号舵机姿态G(识别圆心)
#define Servo2_PosI 966//2号舵机姿态F(成品放置1)
#define Servo2_PosJ 966//2号舵机姿态F(成品放置2)
#define Servo2_PosK 966 //2号舵机姿态F(加工抓取1)
#define Servo2_PosL 966 //2号舵机姿态F(加工抓取2)

#define Servo3_PosA 612  //426//3号舵机姿态A(初始姿态)
#define Servo3_PosB 678//750//3号舵机姿态B(物料区颜色识别)
#define Servo3_PosC 456//749//3号舵机姿态C(物料区，抓取放下)
#define Servo3_PosD 612//509//3号舵机姿态D(物料区，抬起，多组共用)
#define Servo3_PosE 750//444//365//3号舵机姿态E(色环颜色识别)
#define Servo3_PosF 588//612//3号舵机姿态F(加工放置1)
#define Servo3_PosG 762//365//3号舵机姿态G(加工放置2)
#define Servo3_PosH 750//475//2号舵机姿态G(识别圆心)
#define Servo3_PosI 588//2号舵机姿态F(成品放置1)
#define Servo3_PosJ 762//2号舵机姿态F(成品放置2)
#define Servo3_PosK 588 //2号舵机姿态F(加工抓取1)
#define Servo3_PosL 762 //2号舵机姿态F(加工抓取2)

////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////
#define HandOpenpPos  882//840//机械爪松(4号舵机)
#define HandClosepPos 546//530//机械爪紧(4号舵机)
/******************************以上状态确定后不需要再调整*****************************/
////////////////////////////////////////////////////////////////////////////////////









































#endif